InformationRegisters/ПрайсЛистыКонтрагентовВременный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовВременный</Name>
			<Comment>Служит для загрузки и черновой обработки прайс-листов контрагентов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатурной позиции в валюте прайс-листа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретПродажи</Name>
					<Comment>Запрет продажи номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Comment>Количество, которое можем заказывать у поставщика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючСтрокиПоставщика</Name>
					<Comment>Код, ключ строки поставщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТегПозиции</Name>
					<Comment>Тег позиции (группа скидки и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта цены в прайс-листе</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставкиМинимальный</Name>
					<Comment>Минимальный срок поставки до склада поставщика (в секундах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставкиМаксимальный</Name>
					<Comment>Максимальный срок поставки до склада поставщика (в секундах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Представление срока поставки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнятаСПроизводства</Name>
					<Comment>Номенклатура снята с производства</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес позиции прайс-листа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроизводительВПрайсЛисте</Name>
					<Comment>Производитель, как он указан в прайс-листе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстальныеПоляВПрайсЛисте</Name>
					<Comment>Остальные поля строки файла прайс-листа</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЗагрузки</Name>
					<Comment>Признак строки, которую не нужно загружать в основной прайс-лист</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДубли</Name>
					<Comment>Для данной позиции есть дубли по ключевым полям</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Преобразованный артикул для поиска</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Comment>Дата создания записи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПредложения</Name>
					<Comment>Порядковый номер</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрайсЛистыКонтрагентовПравилаЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовПравилаЗагрузки</Name>
			<Comment>Журнал правил загрузки прайс-листов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПравила</Name>
					<Comment>Вид правила</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПравилЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяРеквизитаПрайсЛиста</Name>
					<Comment>Имя реквизита прайс-листа, подлежащего обработке по правилу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Присваиваемое реквизиту значение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПорядокПрименения</Name>
					<Comment>Последовательность применения правил загрузки (В пределах “Объекта правила”)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОригинальное</Name>
					<Comment>Начальное значение реквизита до изменений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеПравила</Name>
					<Comment>Назначение правила загрузки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеПравилЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПравила</Name>
					<Comment>Строка производителя, производитель или ключ строки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПравила</Name>
					<Comment>Идентификатор правила</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НазначениеПравилЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НазначениеПравилЗагрузки</Name>
			<Comment>Назначение правил загрузки прайс-листов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КлючСтроки</Name>
					<Comment>По ключу строки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводительВПрайсЛисте</Name>
					<Comment>По производителю в прайс-листе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производитель</Name>
					<Comment>По производителю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПравилЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПравилЗагрузки</Name>
			<Comment>Виды правил загрузки прайс-листов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗагружать</Name>
					<Comment>Записи по данному виду правил не будут загружаться в программу</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисвоитьЗначение</Name>
					<Comment>Присвоить значение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПрайсЛистыКонтрагентовВременный/Ext/ManagerModule.bsl
// Модуль менеджера регистра "Прайс-листы контрагентов временный"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьПроизводителяВПрайсЛисте(
	ПрайсЛист,
	ПроизводительВПрайсЛисте,
	Производитель,
	НачальныйПроизводитель) Экспорт
	
	// Получим количество записей изменяемых во всех регистрах
	// Выберем все правила, которые надо изменить.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаЗагрузки.ПрайсЛист,
	|	ПравилаЗагрузки.НазначениеПравила,
	|	ПравилаЗагрузки.ОбъектПравила,
	|	ПравилаЗагрузки.ИдентификаторПравила
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПравилаЗагрузки
	|ГДЕ
	|	ПравилаЗагрузки.ПрайсЛист = &ПрайсЛист
	|	И ПравилаЗагрузки.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте)
	|	И (ВЫРАЗИТЬ(ПравилаЗагрузки.ОбъектПравила КАК СТРОКА(100))) = &ПроизводительВПрайсЛисте
	|	И ПравилаЗагрузки.ВидПравила = ЗНАЧЕНИЕ(Перечисление.ВидыПравилЗагрузки.ПрисвоитьЗначение)";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	Запрос.УстановитьПараметр("ПроизводительВПрайсЛисте", ПроизводительВПрайсЛисте);
	ВыборкаПравил = Запрос.Выполнить().Выбрать();
	
	// Обработаем все полученные выборки
	ПервоеПравило = Истина;
	Пока ВыборкаПравил.Следующий() Цикл
		Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, ВыборкаПравил);
		Менеджер.Прочитать();
		Если ПервоеПравило Тогда
			Менеджер.ИмяРеквизитаПрайсЛиста = "Производитель";
			Менеджер.Значение = Производитель;
			Менеджер.ПорядокПрименения = 0;
			Менеджер.ЗначениеОригинальное = Неопределено;
			Менеджер.Записать();
			ПервоеПравило = Ложь;
		Иначе
			// Должно быть только одно такое правило
			Менеджер.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Временный.ПрайсЛист,
	|	Временный.ДатаЗаписи,
	|	Временный.КодПредложения
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовВременный КАК Временный
	|ГДЕ
	|	Временный.ПроизводительВПрайсЛисте = &ПроизводительВПрайсЛисте
	|	И Временный.Производитель = &Производитель
	|	И Временный.ПрайсЛист = &ПрайсЛист";
	Запрос.УстановитьПараметр("ПрайсЛист",                ПрайсЛист);
	Запрос.УстановитьПараметр("Производитель",            НачальныйПроизводитель);
	Запрос.УстановитьПараметр("ПроизводительВПрайсЛисте", ПроизводительВПрайсЛисте);
	
	ВыборкаВрем = Запрос.Выполнить().Выбрать();
	Количество = ВыборкаВрем.Количество();
	
	МассивКлючКтрокиПоставщика = Новый Массив;
	
	Пока ВыборкаВрем.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовВременный.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПрайсЛист.Установить(ВыборкаВрем.ПрайсЛист, Истина);
		НаборЗаписей.Отбор.ДатаЗаписи.Установить(ВыборкаВрем.ДатаЗаписи, Истина);
		НаборЗаписей.Отбор.КодПредложения.Установить(ВыборкаВрем.КодПредложения, Истина);
		НаборЗаписей.Прочитать();
		
		Для Каждого СтрокаНабора Из НаборЗаписей Цикл
			Если МассивКлючКтрокиПоставщика.Найти(СтрокаНабора.КлючСтрокиПоставщика) = Неопределено Тогда
				МассивКлючКтрокиПоставщика.Добавить(СтрокаНабора.КлючСтрокиПоставщика);
			КонецЕсли;
			СтрокаНабора.Производитель = Производитель;
		КонецЦикла;
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	Если МассивКлючКтрокиПоставщика.Количество() > 0 Тогда
		РегистрыСведений.ПрайсЛистыКонтрагентов.ОбновитьЗаписиВОсновномРегистре(ПрайсЛист,, МассивКлючКтрокиПоставщика);
	КонецЕсли;
	
КонецПроцедуры // УстановитьПроизводителяВЗаписяхПрайсЛиста()

Функция УстановитьЗапретЗагрузкиДляПроизводителяВПрайсЛисте(
	ПрайсЛист,
	ПроизводительВПрайсЛисте,
	Производитель,
	ЗапретЗагрузки) Экспорт
	
	НазначениеПравила = Перечисления.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте;
	
	// Проверим наличие правила
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаЗагрузки.ИдентификаторПравила
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПравилаЗагрузки
	|ГДЕ
	|	ПравилаЗагрузки.ПрайсЛист = &ПрайсЛист
	|	И ПравилаЗагрузки.НазначениеПравила = Значение(Перечисление.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте)
	|	И ПравилаЗагрузки.ОбъектПравила = &ПроизводительВПрайсЛисте
	|	И ПравилаЗагрузки.ВидПравила = ЗНАЧЕНИЕ(Перечисление.ВидыПравилЗагрузки.НеЗагружать)
	|	И ПравилаЗагрузки.Значение = &Производитель";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	Запрос.УстановитьПараметр("ПроизводительВПрайсЛисте", ПроизводительВПрайсЛисте);
	Запрос.УстановитьПараметр("Производитель", Производитель);
	
	Результат = Запрос.Выполнить();
	
	НачатьТранзакцию();
	
	Если ЗапретЗагрузки Тогда
		
		Если Результат.Пустой() Тогда
			// Создадим правило
			ИдентификаторПравила = Новый УникальныйИдентификатор;
			Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьМенеджерЗаписи();
			Менеджер.ПрайсЛист = ПрайсЛист;
			Менеджер.НазначениеПравила = Перечисления.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте;
			Менеджер.ОбъектПравила = ПроизводительВПрайсЛисте;
			Менеджер.ИдентификаторПравила = ИдентификаторПравила;
			Менеджер.ВидПравила = Перечисления.ВидыПравилЗагрузки.НеЗагружать;
			Менеджер.Значение = Производитель;
			Менеджер.ЗначениеОригинальное = "Ложь"; // Для стандартного поведения при отмене правила
			Попытка
				Менеджер.Записать();
			Исключение
				ОтменитьТранзакцию();
				//#Если Клиент Тогда
				//	Сообщить(ОписаниеОшибки());
				//#КонецЕсли
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		
		Если Не Результат.Пустой() Тогда
			// Удалим правила
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьМенеджерЗаписи();
				Менеджер.ПрайсЛист = ПрайсЛист;
				Менеджер.НазначениеПравила = Перечисления.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте;
				Менеджер.ОбъектПравила = ПроизводительВПрайсЛисте;
				Менеджер.ИдентификаторПравила = Выборка.ИдентификаторПравила;
				Менеджер.Прочитать();
				Если Менеджер.Выбран() Тогда
					Попытка
						Менеджер.Удалить();
					Исключение
						ОтменитьТранзакцию();
						//#Если Клиент Тогда
						//	Сообщить(ОписаниеОшибки());
						//#КонецЕсли
						Возврат Ложь;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	// Найдем записи временного регистра, которые затрагивают эти изменения
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Временный.КлючСтрокиПоставщика
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовВременный КАК Временный
	|ГДЕ
	|	Временный.ПрайсЛист = &ПрайсЛист
	|	И Временный.ПроизводительВПрайсЛисте = &ПроизводительВПрайсЛисте
	|	И Временный.Производитель = &Производитель
	|";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	Запрос.УстановитьПараметр("Производитель", Производитель);
	Запрос.УстановитьПараметр("ПроизводительВПрайсЛисте", ПроизводительВПрайсЛисте);
	
	МассивКлючСтрокиПоставщика = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КлючСтрокиПоставщика");
	
	Если МассивКлючСтрокиПоставщика.Количество() > 0 Тогда
		РегистрыСведений.ПрайсЛистыКонтрагентов.ОбновитьЗаписиВОсновномРегистре(ПрайсЛист,, МассивКлючСтрокиПоставщика);
	КонецЕсли;
	
КонецФункции

Процедура ОчиститьДанныеПрайсЛиста(ПрайсЛист, ДатаЗаписиПорцииДанных = Неопределено) Экспорт
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрайсЛистыКонтрагентов.ДатаЗаписи
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовВременный КАК ПрайсЛистыКонтрагентов
	|ГДЕ
	|	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист%1";
	
	ОтборПоДате = ?(ДатаЗаписиПорцииДанных = Неопределено, "", " И ПрайсЛистыКонтрагентов.ДатаЗаписи = &ДатаЗаписи");
	
	
	Запрос = Новый Запрос(СтрШаблон(ЗапросТекст, ОтборПоДате));
	Запрос.УстановитьПараметр("ПрайсЛист" , ПрайсЛист);
	Запрос.УстановитьПараметр("ДатаЗаписи", ДатаЗаписиПорцииДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
				
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовВременный");
		
		ЭлементБлокировки.УстановитьЗначение("ПрайсЛист" , ПрайсЛист);
		ЭлементБлокировки.УстановитьЗначение("ДатаЗаписи", Выборка.ДатаЗаписи);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		НачатьТранзакцию();
		Блокировка.Заблокировать();
		
		// Очистим набор записей
		РегистрПрайсЛистов = СоздатьНаборЗаписей();
		РегистрПрайсЛистов.Отбор.ПрайсЛист.Установить(ПрайсЛист);
		РегистрПрайсЛистов.Отбор.ДатаЗаписи.Установить(Выборка.ДатаЗаписи);
		
		Попытка
			РегистрПрайсЛистов.Очистить();
			РегистрПрайсЛистов.Записать(); 
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение ОписаниеОшибки();
		КонецПопытки; 
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли
